Repository: skylab-main/ios
Catalog: Skylab/*.lproj/Localizable.strings
Languages: uk

# TasksViewController.sendButton.title
source: Send for checking
uk: Надіслати на перевірку

# TasksViewController.markButton.pressed.title
source: Task is done!
uk: Завдання виконане!

# TasksViewController.markButton.nonPressed.title
source: Mark task complete
uk: Позначити завдання виконаним

# TasksViewController.codeView.placeHolderText
source: Put your code here...
uk: Вставте ваш код сюди...

# TasksViewController.alertController.title
source: Warning
uk: Увага

# TasksViewController.alertController.message
source: Put your code into the field for checking
uk: Вставте ваш код в поле для перевірки

# LessonsVideoViewController.downloadButton.title
source: Download presentation
uk: Скачати презентацію

# LessonsVideoViewController.telegramButton.title
source: Join Telegram channel with materials
uk: Telegram канал з матеріалами

# VideoViewController.tabSwitcherView.items.lesson
source: Lesson
uk: Урок

# VideoViewController.tabSwitcherView.items.task
source: Task
uk: Завдання

# LessonsViewController.title
source: Lessons
uk: Уроки

# LessonsViewController.descriptionCourseButton.title
source: Full course description
uk: Опис повного курсу

# ResultScene.UINavigationBar.Title
source: Task check
uk: Перевірка завдання

# AuthorizationAPIViewController.topLabel.text
source: Warning! This task checks chatGPT for getting a response - you should be logged in
uk: Увага! Це завдання перевіряє чат GPT, щоб отримати відповідь - авторизуйтесь

# AuthorizationAPIViewController.keyTextField.placeholder.text
source: API key
uk: API ключ

# AuthorizationAPIViewController.continueButton.title
source: Continue
uk: Продовжити

# AuthorizationAPIViewController.manualButton.title.text
source: How to get API key?
uk: Як отримати API ключ?

# ResultCheckViewController.repeatButton.title
source: Try again
uk: Спробувати ще раз

# AuthorizationAPIViewController.alertController.message
source: Enter the correct key. It must be at least 50 characters long
uk: Введіть правильний ключ. Його довжина повинна бути не менше ніж 50 символів

# AuthorizationAPIViewController.alertController.saveApiKeyMessage
source: Save the API key?
uk: Зберегти API ключ?

# AuthorizationAPIViewController.alertController.saveApiKeyMessageYes
source: Yes
uk: Так

# AuthorizationAPIViewController.alertController.saveApiKeyMessageNo
source: No
uk: Ні
